tsung/badge_viewer.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.6.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="true" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="bl-staging-mango.herokuapp.com" port="443" type="ssl"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>
    <session name="http_test_1" probability="80" type="ts_http">

      <!--Badge Builder-->
      <request subst="true">
        <http url="/community/Badge-Builder" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/Badge-Builder/Create-a-learning-group" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/Badge-Builder/Create-Badge" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/Badge-Builder/List-Evidence" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/Badge-Builder/Award-Badge" method="GET" version="1.1">
        </http>
      </request>

      <!--help-->
      <request subst="true">
        <http url="/community/help" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/help/Create-a-learning-group" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/help/Create-a-badge" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/help/Award-your-first-badge" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/help/Teach-someone-else-about-Badge-List" method="GET" version="1.1">
        </http>
      </request>

      <!--blog-->
      <request subst="true">
        <http url="/community/blog" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/blog/Write-a-blog-post" method="GET" version="1.1">
        </http>
      </request>

      <!--Leader-->
      <request subst="true">
        <http url="/community/Leader" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/Leader/Create-a-thriving-learning-community" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/Leader/Spread-the-word" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/Leader/Share-your-vision" method="GET" version="1.1">
        </http>
      </request>

      <!--Pro-->
      <request subst="true">
        <http url="/community/Pro" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/Pro/Use-ALLLL-the-evidence-types" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/Pro/Advanced-Permissions" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/Pro/Start-a-community" method="GET" version="1.1">
        </http>
      </request>

      <request subst="true">
        <http url="/community/Pro/Overview-and-wiki" method="GET" version="1.1">
        </http>
      </request>

      <!--Test Metrics-->
      <request subst="true">
        <http url="/community/Test-Metrics" method="GET" version="1.1">
        </http>
      </request>
    </session>

    <session name="http_test_1" probability="20" type="ts_http">
        <request subst="true">
          <http url="/" method="GET" version="1.1">
          </http>
        </request>

        <request subst="true">
          <http url="/how-it-works" method="GET" version="1.1">
          </http>
        </request>

        <request subst="true">
          <http url="/users/sign_up" method="GET" version="1.1">
          </http>
        </request>

        <request subst="true">
          <http url="/community" method="GET" version="1.1">
          </http>
        </request>

        <request subst="true">
          <http url="/help/docs/Pricing-FAQ" method="GET" version="1.1">
          </http>
        </request>

        <request subst="true">
          <http url="/pricing," method="GET" version="1.1">
          </http>
        </request>
    </session>
  </sessions>

</tsung>