tsung/sign_in_script.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="true" version="1.0">

  <clients>
    <client host="localhost" maxusers="100" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="bl-staging-mango.herokuapp.com" port="443" type="ssl"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="2" unit="minute">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
  </load>

 <sessions>
  <session name="http_test_1" probability="100" type="ts_http">
	<for from="1" to="100" incr="1" var="counter">
      <request subst="true">
        <http url="/users/sign_in" contents='{&quot;user&quot;: {&quot;email&quot;: &quot;vishal.jagtap+5%%_counter%%@zibtek.com&quot;,&quot;password&quot;: &quot;tudip123&quot;}}' content_type='application/json' method="POST" version="1.1">
        </http>
      </request>
    </for>
  </session>
 </sessions>

</tsung>